In [1]:
import numpy as np
import pandas as pd

In [2]:
pd.__version__

'0.23.4'

In [3]:
#Pandas ÂØπË±°ÁÆÄÊ¥Å
##Series ÂØπË±°
data = pd.Series([0.25,0.5,0.75,1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [4]:
print(data.values)
print(data.index)

[0.25 0.5  0.75 1.  ]
RangeIndex(start=0, stop=4, step=1)

   `SeriseÊòØÈÄöÁî®ÁöÑNumPyÊï∞ÁªÑ`

In [5]:

#NumPy Êï∞ÁªÑÈÄöËøáÈöêÂºèÂÆö‰πâÁöÑÊï¥Êï∞Á¥¢ÂºïËé∑ÂèñÊï∞ÂÄºÔºåËÄå Pandas ÁöÑ Series ÂØπË±°Áî®‰∏ÄÁßçÊòæÂºèÂÆö‰πâÁöÑÁ¥¢Âºï‰∏éÊï∞ÂÄºÂÖ≥ËÅî
data = pd.Series([0.25,0.5,0.75,1.0],
                                    index=['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [6]:
data['b']

0.5

`SeriesÊòØÁâπÊÆäÁöÑÂ≠óÂÖ∏`

In [7]:
#‰ΩøÁî®PythonÂ≠óÂÖ∏ÂàõÂª∫SeriesÂØπË±°
population_dict = {'California': 38332521,
                           'Texas': 26448193,
                           'New York': 19651127,
                           'Florida': 19552860,
                           'Illinois': 12882135}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [8]:
population['California']

38332521

In [9]:
population['California':'Florida']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
dtype: int64

`ÂàõÂª∫SeriesÂØπË±°`

In [10]:
pd.Series([2,4,6])

0    2
1    4
2    6
dtype: int64

In [11]:
pd.Series(5,index=[100,200,300])

100    5
200    5
300    5
dtype: int64

In [12]:
pd.Series({2:'a',1:'b',3:'c'})

2    a
1    b
3    c
dtype: object

#PandasÁöÑDataFrameÂØπË±°

`DataFrameÊòØÈÄöÁî®ÁöÑNumPyÊï∞ÁªÑ`

In [2]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)

In [3]:
population_dict = {'California': 38332521,
                           'Texas': 26448193,
                           'New York': 19651127,
                           'Florida': 19552860,
                           'Illinois': 12882135}
population = pd.Series(population_dict)

In [4]:
states = pd.DataFrame({'population': population,
                               'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [5]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [6]:
states.columns

Index(['population', 'area'], dtype='object')

`DataFrameÊòØÁâπÊÆäÁöÑÂ≠óÂÖ∏`

In [7]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

`ÂàõÂª∫DataFrameÂØπË±°`

In [12]:
type(population)

pandas.core.series.Series

In [8]:
#ÈÄöËøáÂçï‰∏™ Series ÂØπË±°ÂàõÂª∫
pd.DataFrame(population,columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

In [13]:
#ÈÄöËøáÂ≠óÂÖ∏ÂàóË°®ÂàõÂª∫
data = [{'a':i,'b':2*i } for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [16]:
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [17]:
#ÈÄöËøá Series ÂØπË±°Â≠óÂÖ∏ÂàõÂª∫
pd.DataFrame({'population': population,
             'area':area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [19]:
#ÈÄöËøá NumPy ‰∫åÁª¥Êï∞ÁªÑÂàõÂª∫
pd.DataFrame(np.random.rand(3,2),
                                columns = ['foo','bar'],
                                index=['a','b','c'])

        foo       bar
a  0.447043  0.579423
b  0.431782  0.216532
c  0.490516  0.618021

In [ ]:
#ÈÄöËøá NumPy ÁªìÊûÑÂåñÊï∞ÁªÑÂàõÂª∫

In [20]:
#PandasÁöÑIndexÂØπË±°
ind = pd.Index([2,3,5,7,11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [21]:
ind[::2]

Int64Index([2, 5, 11], dtype='int64')

In [26]:
#Index ÂØπË±°ËøòÊúâËÆ∏Â§ö‰∏é NumPy Êï∞ÁªÑÁõ∏‰ººÁöÑÂ±ûÊÄß
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [28]:
#Index ÂØπË±°ÈÅµÂæ™ Python Ê†áÂáÜÂ∫ìÁöÑÈõÜÂêàÔºàsetÔºâÊï∞ÊçÆÁªìÊûÑÁöÑËÆ∏Â§ö‰π†ÊÉØÁî®Ê≥ïÔºåÂåÖÊã¨Âπ∂ÈõÜ„ÄÅ‰∫§ÈõÜ„ÄÅÂ∑ÆÈõÜÁ≠â
indA = pd.Index([1,3,5,7,9])
indB = pd.Index([2,3,5,7,11])
indA ^ indB

Int64Index([1, 2, 9, 11], dtype='int64')

‚è¨`SeriesÊï∞ÊçÆÈÄâÊã©ÊñπÊ≥ï`

`Â∞ÜSeriesÁúã‰ΩúÂ≠óÂÖ∏`

In [29]:
import pandas as pd
data = pd.Series([0.25,0.5,0.75,1.0],
                                    index = ['a','b','c','d'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [30]:
data['b']

0.5

In [31]:
'a' in data

True

In [35]:
0.25 in data

False

In [36]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [37]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

`Â∞ÜSeriesÁúã‰Ωú‰∏ÄÁª¥Êï∞ÁªÑ`

In [39]:
## Â∞ÜÊòæÂºèÁ¥¢Âºï‰Ωú‰∏∫ÂàáÁâá
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

In [40]:
# Â∞ÜÈöêÂºèÊï¥Êï∞Á¥¢Âºï‰Ωú‰∏∫ÂàáÁâá
data[0:2]

a    0.25
b    0.50
dtype: float64

In [41]:
# Êé©Á†Å
data[(data > 0.3)&(data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [42]:
## Ëä±Âì®ÁöÑÁ¥¢Âºï
data[['a','e']]

a    0.25
e    1.25
dtype: float64

`Á¥¢ÂºïÂô®Ôºöloc„ÄÅilocÂíåix`
> üí£Ëøô‰∫õÂàáÁâáÂíåÂèñÂÄºÁöÑ‰π†ÊÉØÁî®Ê≥ïÁªèÂ∏∏‰ºöÈÄ†ÊàêÊ∑∑‰π±„ÄÇ‰æãÂ¶ÇÔºåÂ¶ÇÊûú‰Ω†ÁöÑ Series ÊòØÊòæÂºèÊï¥Êï∞Á¥¢ÂºïÔºåÈÇ£‰πà data[1] ËøôÊ†∑ÁöÑÂèñÂÄºÊìç‰Ωú‰ºö‰ΩøÁî®ÊòæÂºèÁ¥¢ÂºïÔºåËÄå data[1:3] ËøôÊ†∑ÁöÑÂàáÁâáÊìç‰ΩúÂç¥‰ºö‰ΩøÁî®ÈöêÂºèÁ¥¢Âºï„ÄÇ

In [43]:
data = pd.Series(['a','b','c'],index=[1,3,5])
data

1    a
3    b
5    c
dtype: object

In [44]:
 # ÂèñÂÄºÊìç‰ΩúÊòØÊòæÂºèÁ¥¢Âºï
data[1]

'a'

In [45]:
# ÂàáÁâáÊìç‰ΩúÊòØÈöêÂºèÁ¥¢Âºï
data[1:3]

3    b
5    c
dtype: object

`Á¨¨‰∏ÄÁßçÁ¥¢ÂºïÂô®ÊòØ loc Â±ûÊÄßÔºåË°®Á§∫ÂèñÂÄºÂíåÂàáÁâáÈÉΩÊòØÊòæÂºèÁöÑÔºö`

In [46]:
data.loc[1]

'a'

In [47]:
data.loc[1:3]

1    a
3    b
dtype: object

`Á¨¨‰∫åÁßçÊòØ iloc Â±ûÊÄßÔºåË°®Á§∫ÂèñÂÄºÂíåÂàáÁâáÈÉΩÊòØ Python ÂΩ¢ÂºèÁöÑ 1 ÈöêÂºèÁ¥¢ÂºïÔºö`
> ‰ªé 0 ÂºÄÂßãÔºåÂ∑¶Èó≠Âè≥ÂºÄÂå∫Èó¥

In [48]:
data.iloc[1:3]

3    b
5    c
dtype: object

‚è¨`DataFrameÊï∞ÊçÆÈÄâÊã©ÊñπÊ≥ï`

`Â∞ÜDataFrameÁúã‰ΩúÂ≠óÂÖ∏`

In [51]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                          'New York': 141297, 'Florida': 170312,
                          'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                         'New York': 19651127, 'Florida': 19552860,
                         'Illinois': 12882135})
data = pd.DataFrame({'area':area,'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [52]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [53]:
#ÂèØ‰ª•Áî®Â±ûÊÄßÂΩ¢ÂºèÔºàattribute-styleÔºâÈÄâÊã©Á∫ØÂ≠óÁ¨¶‰∏≤ÂàóÂêçÁöÑÊï∞ÊçÆ
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [54]:
data.area is data['area']

True

In [55]:
data['density']  = data['pop'] / data['area']

`Â∞ÜDataFrameÁúã‰Ωú‰∫åÁª¥Êï∞ÁªÑ`

In [56]:
data.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [57]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [58]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [59]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [60]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [62]:
data.iloc[:3,:2]
#Âéª0-2Ë°åÔºå0-1ÂàóÁöÑÊï∞ÊçÆ

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [63]:
data.loc[:'Illinois',:'pop']
#ÊòæÁ§∫ÔºöÊåâË°åÂèñÂà∞‰ºäÂà©ËØ∫‰ºäÔºåÊ°àÂàóÂèñÂà∞Â∑û‰∫∫Âè£

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [64]:
#ÂèØ‰ª•Âú® loc Á¥¢ÂºïÂô®‰∏≠ÁªìÂêà‰ΩøÁî®Êé©Á†Å‰∏éËä±Âì®ÁöÑÁ¥¢ÂºïÊñπÊ≥ïÔºö
data.loc[data.density > 100,['pop','density']]

               pop     density
New York  19651127  139.076746
Florida   19552860  114.806121

`ÂÖ∂‰ªñÂèñÂÄºÊñπÊ≥ï`

In [65]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [66]:
data[1:3]

            area       pop     density
Texas     695662  26448193   38.018740
New York  141297  19651127  139.076746

In [67]:
data[data.density >100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

üñ©`PandasÊï∞ÂÄºËøêÁÆóÊñπÊ≥ï`

In [69]:
np.random.seed(42)
ser = pd.Series(np.random.randint(0,10,4))
df = pd.DataFrame(np.random.randint(0,10,(3,4)),
                 columns=['A','B','C','D'])
print(ser)
print('\t')
print(df)

0    6
1    3
2    7
3    4
dtype: int32

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

> ÂØπ‰∫é‰∏ÄÂÖÉËøêÁÆóÔºàÂÉèÂáΩÊï∞‰∏é‰∏âËßíÂáΩÊï∞ÔºâÔºåËøô‰∫õÈÄöÁî®ÂáΩÊï∞Â∞ÜÂú®ËæìÂá∫ÁªìÊûú‰∏≠‰øùÁïôÁ¥¢ÂºïÂíåÂàóÊ†áÁ≠æÔºõËÄåÂØπ‰∫é‰∫åÂÖÉËøêÁÆóÔºàÂ¶ÇÂä†Ê≥ïÂíå‰πòÊ≥ïÔºâÔºåPandas Âú®‰º†ÈÄíÈÄöÁî®ÂáΩÊï∞Êó∂‰ºöËá™Âä®ÂØπÈΩêÁ¥¢ÂºïËøõË°åËÆ°ÁÆó„ÄÇ

In [70]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [71]:
np.sin(df*np.pi/4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

`ÈÄöÁî®ÂáΩÊï∞ÔºöÁ¥¢ÂºïÂØπÈΩê`

`01 SeriesÁ¥¢ÂºïÂØπÈΩê`

In [75]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
                         'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193,
                               'New York': 19651127}, name='population')

In [76]:
# ÁªìÊûúÊï∞ÁªÑÁöÑÁ¥¢ÂºïÊòØ‰∏§‰∏™ËæìÂÖ•Êï∞ÁªÑÁ¥¢ÂºïÁöÑÂπ∂ÈõÜ
population/area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [78]:
#ÂØπ‰∫éÁº∫Â§±‰ΩçÁΩÆÁöÑÊï∞ÊçÆÔºåPandas‰ºöÁî®NaNÂ°´ÂÖÖ„ÄÇ
A = pd.Series([2,4,6],index=[0,1,2])
B = pd.Series([1,3,5],index=[1,2,3])
A+B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

`Â¶ÇÊûúÁî® NaN ÂÄº‰∏çÊòØÊàë‰ª¨ÊÉ≥Ë¶ÅÁöÑÁªìÊûúÔºåÈÇ£‰πàÂèØ‰ª•Áî®ÈÄÇÂΩìÁöÑÂØπË±°ÊñπÊ≥ï‰ª£ÊõøËøêÁÆóÁ¨¶„ÄÇ`

In [79]:
A.add(B,fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

`02DataFrameÁ¥¢ÂºïÂØπÈΩê`

In [82]:
A = pd.DataFrame(np.random.randint(0,20,(2,2)),
                columns = list('AB'))

B = pd.DataFrame(np.random.randint(0,10,(3,3)),
                columns = list('ABC'))
print(A)
print('\t')
print(B)

    A   B
0   9  15
1  14  14

   A  B  C
0  2  6  3
1  8  2  4
2  2  6  4

In [84]:
A+B

      A     B   C
0  11.0  21.0 NaN
1  22.0  16.0 NaN
2   NaN   NaN NaN

In [85]:
#Áî® A ‰∏≠ÊâÄÊúâÂÄºÁöÑÂùáÂÄºÊù•Â°´ÂÖÖÁº∫Â§±ÂÄºÔºàËÆ°ÁÆó A ÁöÑÂùáÂÄºÈúÄË¶ÅÁî® stack Â∞Ü‰∫åÁª¥Êï∞ÁªÑÂéãÁº©Êàê‰∏ÄÁª¥Êï∞ÁªÑÔºâÔºö
fill = A.stack().mean()
A.add(B,fill_value=fill)

      A     B     C
0  11.0  21.0  16.0
1  22.0  16.0  17.0
2  15.0  19.0  17.0

`ÈÄöÁî®ÂáΩÊï∞ÔºöDataFrame‰∏éSeriesÁöÑËøêÁÆó`

In [90]:
df = pd.DataFrame(np.random.randint(10,size=(3,4)),columns=list('QRST'))
df
# df.iloc[0]

   Q  R  S  T
0  6  7  2  0
1  3  1  7  3
2  1  5  5  9

üç™

In [92]:
df- df.iloc[0]
#dfÊØèË°åÂáèÂéªÁ¨¨‰∏ÄË°å

   Q  R  S  T
0  0  0  0  0
1 -3 -6  5  3
2 -5 -2  3  9

In [100]:
df.subtract(df['R'],axis=0)
#dfÊØèÂàóÂáèÂéªRÂàóÂÄº

   Q  R  S  T
0 -1  0 -5 -7
1  2  0  6  2
2 -4  0  0  4

üç™

In [101]:
halfrow = df.iloc[0,::2]
halfrow

Q    6
S    2
Name: 0, dtype: int32

In [102]:
df - halfrow

     Q   R    S   T
0  0.0 NaN  0.0 NaN
1 -3.0 NaN  5.0 NaN
2 -5.0 NaN  3.0 NaN

`Â§ÑÁêÜÁº∫Â§±ÂÄº`

`NoneÔºöPythonÂØπË±°Á±ªÂûãÁöÑÁº∫Â§±ÂÄº`

In [110]:
vals = np.array([1,None,3,4])
vals

array([1, None, 3, 4], dtype=object)

> ‰ΩøÁî® Python ÂØπË±°ÊûÑÊàêÁöÑÊï∞ÁªÑÂ∞±ÊÑèÂë≥ÁùÄÂ¶ÇÊûú‰Ω†ÂØπ‰∏Ä‰∏™ÂåÖÂê´ None ÁöÑÊï∞ÁªÑËøõË°åÁ¥ØËÆ°Êìç‰ΩúÔºåÂ¶Ç sum() ÊàñËÄÖ min()ÔºåÈÇ£‰πàÈÄöÂ∏∏‰ºöÂá∫Áé∞Á±ªÂûãÈîôËØØÔºö

In [111]:
vals.sum()

TypeError: unsupported operand type(s) for +: 'int' and 'NoneType'

`NaNÔºöÊï∞ÂÄºÁ±ªÂûãÁöÑÁº∫Â§±ÂÄº`

In [116]:
vals2 = np.array([1,np.nan,3,4])
vals2.dtype

dtype('float64')

In [117]:
#Êó†ËÆ∫Âíå NaN ËøõË°å‰ΩïÁßçÊìç‰ΩúÔºåÊúÄÁªàÁªìÊûúÈÉΩÊòØ NaNÔºö
vals2.sum()

nan

`Pandas‰∏≠NaN‰∏éNoneÁöÑÂ∑ÆÂºÇ`

In [118]:
pd.Series([1,np.nan,2,None])

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [121]:
#Â§ÑÁêÜÁº∫Â§±ÂÄº
## ÂàõÂª∫‰∏Ä‰∏™Â∏ÉÂ∞îÁ±ªÂûãÁöÑÊé©Á†ÅÊ†áÁ≠æÁº∫Â§±ÂÄº
isnull()
## ‰∏éisnull()Êìç‰ΩúÁõ∏Âèç
notnull()
##ËøîÂõû‰∏Ä‰∏™ÂâîÈô§Áº∫Â§±ÂÄºÁöÑÊï∞ÊçÆ
dropna()
##ËøîÂõû‰∏Ä‰∏™Â°´ÂÖÖ‰∫ÜÁº∫Â§±ÂÄºÁöÑÊï∞ÊçÆÂâØÊú¨

In [122]:
data = pd.Series([1,np.nan,'hello',None])
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [123]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [124]:
data.dropna()

0        1
2    hello
dtype: object

In [125]:
df = pd.DataFrame([[1,      np.nan, 2],
                           [2,      3,      5],
                           [np.nan, 4,      6]])
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [126]:
df.dropna()

     0    1  2
1  2.0  3.0  5

In [127]:
df.dropna(axis='columns')

   2
0  2
1  5
2  6

In [128]:
#ÈÄöËøáËÆæÁΩÆ how Êàñ thresh ÂèÇÊï∞Êù•Êª°Ë∂≥ÔºåÂÆÉ‰ª¨ÂèØ‰ª•ËÆæÁΩÆÂâîÈô§Ë°åÊàñÂàóÁº∫Â§±ÂÄºÁöÑÊï∞ÈáèÈòàÂÄº„ÄÇ
df[3] = np.nan
df.dropna(axis='columns',how='all')
#‰ªÖÂΩìËØ•ÂàóÂÖ®ÈÉ®‰∏∫nanÊó∂ÊâçÂâîÈô§

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [132]:
df.dropna(axis='rows',thresh=3)
#ÊåâË°åÊìç‰ΩúÔºåthresh ÂèÇÊï∞ËÆæÁΩÆË°åÊàñÂàó‰∏≠ÈùûÁº∫Â§±ÂÄºÁöÑÊúÄÂ∞èÊï∞Èáè
#Âç≥‰øùÁïôÈùûÁº∫Â§±ÂÄºÂ§ß‰∫éÁ≠â‰∫é3ÁöÑË°åÔºåÂõ†Ê≠§Á¨¨‰∏ÄË°åË¢´‰øùÁïô‰∏ãÊù•

     0    1  2   3
1  2.0  3.0  5 NaN

In [133]:
#Â°´ÂÖÖÁº∫Â§±ÂÄº
data = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
data

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [134]:
data.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [135]:
#ÂèØ‰ª•Áî®Áº∫Â§±ÂÄºÂâçÈù¢ÁöÑÊúâÊïàÂÄºÊù•‰ªéÂâçÂæÄÂêéÂ°´ÂÖÖÔºàforward-fillÔºâÔºö
#‰ΩøÁî®Ââç‰∏Ä‰∏™ÂÄºÊù•Â°´ÂÖÖÊúÄËøëÁöÑÁº∫Â§±ÂÄº
data.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [136]:
# ‰ªéÂêéÂæÄÂâçÂ°´ÂÖÖ
data.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

üï≥Ô∏è`Â±ÇÁ∫ßÁ¥¢Âºï`
Could use for financial report!

`ÂêàÂπ∂Êï∞ÊçÆÈõÜÔºöConcat‰∏éAppendÊìç‰Ωú`

In [137]:
def make_df(cols,ind):
    data = {c:[str(c) + str(i) for i in ind]
           for c in cols}
    return pd.DataFrame(data,ind)

In [138]:
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

`ÈÄöËøápd.concatÂÆûÁé∞ÁÆÄÊòìÂêàÂπ∂`

In [139]:
ser1 = pd.Series(['A','B','C'],index=[1,2,3])
ser2 = pd.Series(['D','E','F'],index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [140]:
pd.concat([ser1,ser2],axis=1)

     0    1
1    A  NaN
2    B  NaN
3    C  NaN
4  NaN    D
5  NaN    E
6  NaN    F

In [141]:
df1 = make_df('AB',[1,2])
df2 = make_df('AB',[3,4])
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [142]:
df3 = make_df('AB',[0,1])
df4 = make_df('CD',[0,1])
pd.concat([df3,df4],axis=1)

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

`Á¥¢ÂºïÈáçÂ§ç`
> Pandas Âú®ÂêàÂπ∂Êó∂‰ºö‰øùÁïôÁ¥¢ÂºïÔºåÂç≥‰ΩøÁ¥¢ÂºïÊòØÈáçÂ§çÁöÑÔºÅ

In [145]:
x = make_df('AB',[0,1])
y = make_df('AB',[2,3])
y.index = x.index
pd.concat([x,y])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

`(1) ÊçïÊçâÁ¥¢ÂºïÈáçÂ§çÁöÑÈîôËØØ`

In [151]:
try:
    pd.concat([x,y],verify_integrity=True)
except ValueError as e:
    print("ValueError:",e)

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

`(2) ÂøΩÁï•Á¥¢Âºï`

In [152]:
pd.concat([x,y],ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

`(3) Â¢ûÂä†Â§öÁ∫ßÁ¥¢Âºï`

In [153]:
pd.concat([x,y],keys=['x','y'])

      A   B
x 0  A0  B0
  1  A1  B1
y 0  A2  B2
  1  A3  B3

`Á±ª‰ººjoinÁöÑÂêàÂπ∂`

In [154]:
df5 = make_df('ABC',[1,2])
df6 = make_df('BCD',[3,4])
pd.concat([df5,df6])

d:\python\python36-32\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A   B   C    D
1   A1  B1  C1  NaN
2   A2  B2  C2  NaN
3  NaN  B3  C3   D3
4  NaN  B4  C4   D4

In [155]:
pd.concat([df5,df6],join='inner')

    B   C
1  B1  C1
2  B2  C2
3  B3  C3
4  B4  C4

In [156]:
pd.concat([df5,df6],join_axes=[df5.columns])

     A   B   C
1   A1  B1  C1
2   A2  B2  C2
3  NaN  B3  C3
4  NaN  B4  C4

`append()ÊñπÊ≥ï`

In [161]:
pd.concat([df1,df2]) is df1.append(df2)
#Dont know why

False

In [162]:
pd.concat([df1,df2])

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [163]:
df1.append(df2)

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

`ÂêàÂπ∂Êï∞ÊçÆÈõÜÔºöÂêàÂπ∂‰∏éËøûÊé•`

`Êï∞ÊçÆËøûÊé•ÁöÑÁ±ªÂûã`

In [165]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
print(df1);
print('\t')
print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [166]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [167]:
df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                           'supervisor': ['Carly', 'Guido', 'Steve']})
df4

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [169]:
pd.merge(df1,df4)

  employee        group supervisor
0      Bob   Accounting      Carly
1     Jake  Engineering      Guido
2     Lisa  Engineering      Guido
3      Sue           HR      Steve

In [170]:
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],
                                            'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [171]:
pd.merge(df1,df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

`ËÆæÁΩÆÊï∞ÊçÆÂêàÂπ∂ÁöÑÈîÆ`

In [172]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [173]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [174]:
pd.merge(df1,df3,left_on='employee',right_on='name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [175]:
pd.merge(df1,df3,left_on='employee',right_on='name').drop('name',axis=1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

`left_index‰∏éright_indexÂèÇÊï∞`

In [176]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a);print('\t');print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR

          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

`ÂêàÂπ∂Á¥¢Âºï`

In [177]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [178]:
df1a.join(df2a)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [179]:
pd.merge(df1a,df3,left_index=True,right_on='name')

         group  name  salary
0   Accounting   Bob   70000
1  Engineering  Jake   80000
2  Engineering  Lisa  120000
3           HR   Sue   90000

`ËÆæÁΩÆÊï∞ÊçÆËøûÊé•ÁöÑÈõÜÂêàÊìç‰ΩúËßÑÂàô`

ÂáΩÊï∞pd.merge()‰∏≠,ÂèÇÊï∞howÈªòËÆ§'inner','outer','left','right'

In [181]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                            'food': ['fish', 'beans', 'bread']},
                           columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                            'drink': ['wine', 'beer']},
                           columns=['name', 'drink'])
print(df6);print('\t');print(df7)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

     name drink
0    Mary  wine
1  Joseph  beer

In [182]:
pd.merge(df6,df7,how='outer')

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [183]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

`ÈáçÂ§çÂàóÂêçÔºösuffixesÂèÇÊï∞`

In [184]:
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                            'rank': [1, 2, 3, 4]})
df9 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                            'rank': [3, 1, 4, 2]})
print(df8);print('\t');print(df9)

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4

   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [185]:
pd.merge(df8,df9,on='name',suffixes=["_L","_R"])

   name  rank_L  rank_R
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

\begin{exercise}
Ê°à‰æãÔºöÁæéÂõΩÂêÑÂ∑ûÁöÑÁªüËÆ°Êï∞ÊçÆ
\end{exercise}

In [192]:
import sys,os
os.chdir("C:\\Users\\randa\\Desktop\\JupyterNote\\Python\\Python_manual\\PythonDataScienceHandbook-master\\notebooks\\data")

pop = pd.read_csv("state-population.csv")
areas = pd.read_csv('state-areas.csv')
abbrevs = pd.read_csv('state-abbrevs.csv')

print(pop.head());print(areas.head());print(abbrevs.head())

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [190]:
pop.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [193]:
abbrevs.head()

        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [194]:
merged = pd.merge(pop,abbrevs,how='outer',
                 left_on = 'state/region',right_on='abbreviation')

merged = merged.drop('abbreviation',1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [195]:
#ÈÄêÊÆµÊ£ÄÊü•ÊòØÂê¶ÊúâÁº∫Â§±ÂÄº
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [196]:
merged[merged['population'].isnull()].head()

     state/region     ages  year  population state
2448           PR  under18  1990         NaN   NaN
2449           PR    total  1990         NaN   NaN
2450           PR    total  1991         NaN   NaN
2451           PR  under18  1991         NaN   NaN
2452           PR    total  1993         NaN   NaN

In [197]:
merged.loc[merged['state'].isnull(),'state/region'].unique()

array(['PR', 'USA'], dtype=object)

In [198]:
merged.loc[merged['state/region']=='PR','state'] = 'Puerto Rico'
merged.loc[merged['state/region']=='USA','state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [200]:
final = pd.merge(merged,areas,on='state',how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [201]:
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [203]:
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [204]:
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [205]:
data2010 = final.query("year==2010 & ages =='total'")
data2010.head()

    state/region   ages  year  population       state  area (sq. mi)
3             AL  total  2010   4785570.0     Alabama        52423.0
91            AK  total  2010    713868.0      Alaska       656425.0
101           AZ  total  2010   6408790.0     Arizona       114006.0
189           AR  total  2010   2922280.0    Arkansas        53182.0
197           CA  total  2010  37333601.0  California       163707.0

In [206]:
data2010.set_index('state',inplace=True)
density = data2010['population'] / data2010['area (sq. mi)']

In [207]:
density.sort_values(ascending=False,inplace=True)
density.head()

state
District of Columbia    8898.897059
Puerto Rico             1058.665149
New Jersey              1009.253268
Rhode Island             681.339159
Connecticut              645.600649
dtype: float64

In [208]:
density.tail()

state
South Dakota    10.583512
North Dakota     9.537565
Montana          6.736171
Wyoming          5.768079
Alaska           1.087509
dtype: float64

`Á¥ØËÆ°‰∏éÂàÜÁªÑ`

In [209]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [210]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

`DataFrame ÁöÑÁ¥ØËÆ°ÂáΩÊï∞ÈªòËÆ§ÂØπÊØèÂàóËøõË°åÁªüËÆ°Ôºö`

In [214]:
np.random.seed(0)
df = pd.DataFrame({'A':np.random.rand(5),
                                          'B':np.random.rand(5)})
df

          A         B
0  0.548814  0.645894
1  0.715189  0.437587
2  0.602763  0.891773
3  0.544883  0.963663
4  0.423655  0.383442

In [215]:
df.mean()

A    0.567061
B    0.664472
dtype: float64

In [218]:
df.mean(axis='columns')

0    0.597354
1    0.576388
2    0.747268
3    0.754273
4    0.403548
dtype: float64

In [219]:
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

`GroupByÔºöÂàÜÂâ≤„ÄÅÂ∫îÁî®ÂíåÁªÑÂêà`

In [221]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                               'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [223]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [224]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

`ÊåâÂàóÂèñÂÄº`

In [226]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

`ÊåâÁªÑËø≠‰ª£`

In [227]:
for (method,group) in planets.groupby('method'):
    print("{0:30s} shape={1}".format(method,group.shape))

Astrometry                     shape=(2, 6)
Eclipse Timing Variations      shape=(9, 6)
Imaging                        shape=(38, 6)
Microlensing                   shape=(23, 6)
Orbital Brightness Modulation  shape=(3, 6)
Pulsar Timing                  shape=(5, 6)
Pulsation Timing Variations    shape=(1, 6)
Radial Velocity                shape=(553, 6)
Transit                        shape=(397, 6)
Transit Timing Variations      shape=(4, 6)

` Ë∞ÉÁî®ÊñπÊ≥ï`

In [228]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

`Á¥ØËÆ°„ÄÅËøáÊª§„ÄÅËΩ¨Êç¢ÂíåÂ∫îÁî®`

In [230]:
np.random.seed(0)
df = pd.DataFrame({
    'key':['A','B','C','A','B','C'],
    'data1':range(6),
    'data2':np.random.randint(0,10,6)
},columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      5
1   B      1      0
2   C      2      3
3   A      3      3
4   B      4      7
5   C      5      9

In [231]:
df.groupby('key').aggregate(['min',np.median,max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     3    4.0   5
B       1    2.5   4     0    3.5   7
C       2    3.5   5     3    6.0   9

In [232]:
df.groupby('key').aggregate({'data1':'min',
                                                             'data2':'max'})

     data1  data2
key
A        0      5
B        1      7
C        2      9

In [235]:
def filter_func(x):
    return x['data2'].std() >4

df.groupby('key').filter(filter_func)

  key  data1  data2
1   B      1      0
2   C      2      3
4   B      4      7
5   C      5      9

In [236]:
df.groupby('key').transform(lambda x:x-x.mean())

   data1  data2
0   -1.5    1.0
1   -1.5   -3.5
2   -1.5   -3.0
3    1.5   -1.0
4    1.5    3.5
5    1.5    3.0

In [239]:
def norm_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.142857      0
2   C  0.166667      3
3   A  0.375000      3
4   B  0.571429      7
5   C  0.416667      9

`ËÆæÁΩÆÂàÜÂâ≤ÁöÑÈîÆ`

In [240]:
L = [0,1,0,1,2,0]
df.groupby(L).sum()

   data1  data2
0      7     17
1      4      3
2      4      7

In [241]:
#Áî®Â≠óÂÖ∏Êàñ Series Â∞ÜÁ¥¢ÂºïÊò†Â∞ÑÂà∞ÂàÜÁªÑÂêçÁß∞
df2 = df.set_index('key')
mapping = {'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}
df2.groupby(mapping).sum()

           data1  data2
consonant     12     19
vowel          3      8

In [242]:
#‰ªªÊÑè Python ÂáΩÊï∞
df2.groupby(str.lower).mean()

   data1  data2
a    1.5    4.0
b    2.5    3.5
c    3.5    6.0

In [243]:
mapping

{'A': 'vowel', 'B': 'consonant', 'C': 'consonant'}

In [244]:
#(4) Â§ö‰∏™ÊúâÊïàÈîÆÊûÑÊàêÁöÑÂàóË°®
df2.groupby([str.lower, mapping]).mean()

             data1  data2
a vowel        1.5    4.0
b consonant    2.5    3.5
c consonant    3.5    6.0

In [245]:
#ÂàÜÁªÑÊ°à‰æã
decade = 10 * (planets['year'] // 10)
decade = decade.astype(str) + 's'
decade.name = 'decade'
planets.groupby(['method', decade])['number'].sum().unstack().fillna(0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [ ]:
Êï∞ÊçÆÈÄèËßÜË°®